# MASF-YOLO (YOLOv11 改进版：MFAM + IEMA + 三路DASI + P2检测层)

nc: 80

scales:
  s: [0.50, 0.50, 1024]

backbone:
  # [from, number, module, args]
  - [-1, 1, CBS, [64, 3, 2]]        # 0
  - [-1, 1, CBS, [128, 3, 2]]       # 1
  - [-1, 1, C3k2, [128]]            # 2
  - [-1, 1, MFAM, [128, 128]]       # 3 (P2)

  - [-1, 1, CBS, [256, 3, 2]]       # 4
  - [-1, 1, C3k2, [256]]            # 5
  - [-1, 1, MFAM, [256, 256]]       # 6 (P3)

  - [-1, 1, CBS, [512, 3, 2]]       # 7
  - [-1, 1, C3k2, [512]]            # 8
  - [-1, 1, MFAM, [512, 512]]       # 9 (P4)

  - [-1, 1, CBS, [1024, 3, 2]]      # 10
  - [-1, 1, SPPF, [1024, 5]]        # 11
  - [-1, 1, C2PSA, [1024]]          # 12
  - [-1, 1, MFAM, [1024, 1024]]     # 13 (P5)

head:
  - [[6, 9, 13], 1, DASI, [256, 512, 1024, 512]]  # 14 (三路DASI: low=P4, mid=P5-pre, high=P5)
  - [-1, 1, C3k2, [512]]            # 15
  - [-1, 1, IEMA, [512]]            # 16 (P4_out)

  - [[3, 6, 16], 1, DASI, [128, 256, 512, 256]]    # 17
  - [-1, 1, C3k2, [256]]            # 18
  - [-1, 1, IEMA, [256]]            # 19 (P3_out)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                   #20
  - [[-1, 3], 1, Concat, [1]]                                   #21
  - [-1, 1, C3k2, [128]]            # 22

  # P2 detect
  - [-1, 1, IEMA, [128]]              # 23
  - [[-1, 3], 1, Concat, [1]]         # 24 (Concat P2_out + backbone P2)
  - [-1, 1, C3k2, [128]]              # 25
  - [-1, 1, IEMA, [128]]              # 26 detect

  # P3 detect
  - [-1, 1, CBS, [256, 3, 2]]         # 27 (下采样对齐)
  - [[-1, 6,17], 1, Concat, [1]]      #  28(Concat with backbone P3)
  - [-1, 1, C3k2, [256]]              # 29
  - [-1, 1, IEMA, [256]]              # 30 detect

  # P4 detect
  - [-1, 1, CBS, [512, 3, 2]]         # 31
  - [[-1, 9,14], 1, Concat, [1]]      # 32 (Concat with backbone P4)
  - [-1, 1, C3k2, [512]]              # 33
  - [-1, 1, IEMA, [512]]              # 34

  # P5 detect
  - [-1, 1, CBS, [1024, 3, 2]]         # 35
  - [[-1, 13], 1, Concat, [1]]         # 36 Concat with backbone P5 (13)
  - [-1, 1, C3k2, [1024]]              # 37
  - [-1, 1, IEMA, [1024]]              # 38

  - [[26, 30, 34, 38], 1, Detect, [nc]]