[
    [
        "pedestrian",
        "A pedestrian is a person who is walking or moving on foot in public spaces. Object which Feature has a human body with distinguishable head, torso, arms, and legs, often exhibiting upright posture and natural gait motion. Object which Feature has varying clothing styles such as jackets, coats, shirts, pants, shorts, dresses, skirts, and seasonal outfits including thick winter wear or light summer clothing. Object which Feature has accessories like backpacks, handbags, shopping bags, hats, caps, sunglasses, umbrellas, or electronic devices such as phones or headphones. Object which Feature has different footwear including sneakers, boots, sandals, or dress shoes depending on environment and activity. Object which Feature exhibits diverse physical appearances such as different heights, body shapes, ages, skin tones, hairstyles, and facial features. Object which Feature is often seen walking, standing, waiting, crossing streets, turning, looking around, or interacting with surrounding people or objects. Object which Feature is sometimes running, jogging, climbing stairs, or riding mobility devices such as scooters or skateboards. Object which Feature may carry items in hands, hold umbrellas, push strollers, or pull luggage. Object which Feature often shows dynamic poses including bent legs during walking, swinging arms, leaning forward, or maintaining balance while moving. Object which Feature appears in various environments such as sidewalks, crosswalks, roadsides, parks, plazas, shopping areas, transportation hubs, and building entrances. Object which Feature may be partially occluded by vehicles, other people, street poles, trees, or urban structures. Object which Feature can appear alone or in groups, sometimes walking in pairs, crowds, or family formations. Object which Feature interacts visually with surroundings through posture orientation, gaze direction, hand gestures, or movement patterns. Object which Feature shows strong visual cues such as human shape silhouette, limb proportions, clothing color, carried objects, and motion-related blur when captured in dynamic scenes. "
    ],
    [
        "people",
        "People are human individuals or groups present in a scene, exhibiting a wide range of appearances, clothing styles, and behaviors. Object which Feature has human body structure including head, torso, arms, and legs, with natural upright or partially bent posture depending on activity. Object which Feature may appear as single individuals, pairs, small groups, or large crowds, forming various spatial arrangements and densities. Object which Feature has diverse physical characteristics such as different ages, heights, body proportions, skin tones, hairstyles, and facial features, commonly observed in public environments. Object which Feature has varied clothing including casual wear, formal wear, work uniforms, sportswear, winter coats, summer clothing, and regional cultural attire. Object which Feature may carry accessories such as backpacks, handbags, suitcases, umbrellas, hats, wallets, shopping bags, phones, cameras, or electronic devices. Object which Feature shows dynamic behaviors such as standing, walking, running, turning, bending, sitting, waiting, interacting, or gesturing. Object which Feature may be engaged in daily activities like commuting, shopping, sightseeing, working, talking with others, or using mobile devices. Object which Feature may appear stationary or in motion, sometimes moving in coordinated flow within crowds or randomly distributed in open spaces. Object which Feature often exhibits visual cues including clothing color, silhouette, gait pattern, hairstyle, posture orientation, and group formations that help distinguish individuals. Object which Feature can be partially occluded by other people, vehicles, buildings, street furniture, or environmental elements in complex scenes. Object which Feature appears in various indoor and outdoor locations such as streets, sidewalks, parks, plazas, stations, malls, offices, schools, and residential areas. Object which Feature may form lines, clusters, or dispersed patterns, influenced by social interactions and environmental context. Object which Feature reflects human motion and interaction through gestures, body language, gaze direction, and movement trajectories. "
    ],
    [
        "bicycle",
        "A bicycle is a human-powered two-wheeled vehicle designed for personal transportation and maneuverability. Object which Feature has a lightweight frame made of metal alloys or carbon materials, forming a triangular or curved structural shape. Object which Feature has two wheels aligned in a single forward direction, typically featuring rubber tires, spokes, hubs, and visible wheel rims. Object which Feature has handlebars used for steering, connected to the front fork, allowing directional control and balance adjustment. Object which Feature has a saddle or seat mounted above the frame, enabling a rider to sit while pedaling. Object which Feature has pedals connected through a crankset and chain system that transmits human power to the rear wheel, enabling forward motion. Object which Feature may have additional components such as brakes, gear systems, chains, derailleurs, reflectors, lights, baskets, or luggage racks. Object which Feature appears in different types such as road bicycles, mountain bicycles, city bikes, folding bikes, children’s bicycles, or shared rental bikes. Object which Feature has a variety of colors including black, white, red, blue, yellow, green, silver, or mixed patterns depending on brand and design. Object which Feature may be observed in various states such as standing upright with a kickstand, leaning against a pole or wall, being ridden by a person, or lying on the ground. Object which Feature may show motion blur when being ridden, especially at the wheels, pedals, and legs of the rider. Object which Feature often appears on streets, bicycle lanes, sidewalks, parks, campuses, residential areas, and public transportation stations. Object which Feature may be partially occluded by riders, pedestrians, vehicles, fences, or environmental objects in complex scenes. Object which Feature displays structural features including wheel size, frame geometry, handlebar shape, saddle height, and color patterns that help distinguish it visually. Object which Feature can be seen as part of daily commuting, exercise, delivery services, leisure activities, or transportation in urban and rural environments. "
    ],
    [
        "car",
        "A car is a four-wheeled motor vehicle designed for personal transportation, featuring an enclosed cabin and structured body. Object which Feature has a rigid metal or composite frame forming the chassis, supporting exterior panels, windows, and internal mechanical systems. Object which Feature has four wheels with rubber tires, visible rims, hubcaps, and varying tread patterns, providing stability and road contact. Object which Feature has a front section that may include headlights, grille designs, air intakes, and a hood covering the engine compartment. Object which Feature has a rear section that typically contains taillights, bumpers, exhaust outlets, and a trunk or cargo area. Object which Feature has doors on one or both sides, sometimes two, four, or more depending on vehicle design. Object which Feature transparent glass windows and a windshield, providing visibility for driving and passenger comfort. Object which Feature may have side mirrors, roof racks, sunroofs, antennas, or aerodynamic elements such as spoilers. Object which Feature comes in many body types including sedan, hatchback, SUV, coupe, convertible, minivan, station wagon, or sports car. Object which Feature has varying colors such as white, black, silver, gray, red, blue, yellow, green, brown, or multicolored patterns depending on manufacturer and customization. Object which Feature may feature brand-specific designs like emblem shapes, grille patterns, headlight signatures, and body contours. Object which Feature can appear in various states including parked, moving, turning, accelerating, braking, or idling. Object which Feature may exhibit motion blur on wheels or body when captured at high speed in images. Object which Feature commonly appears on roads, highways, parking lots, driveways, intersections, gas stations, residential areas, and commercial zones. Object which Feature may be partially occluded by pedestrians, bicycles, trees, buildings, or other vehicles in urban scenes. Object which Feature provides strong visual cues such as wheel structure, body shape, window layout, lighting configuration, and color distribution that help distinguish it from other vehicle types. "
    ],
    [
        "van",
        "A van is a medium-sized motor vehicle designed to transport passengers or cargo, featuring a large enclosed body and extended interior space. Object which Feature has a boxy or semi-boxy exterior shape with a tall roofline, providing greater vertical capacity compared to standard cars. Object which Feature has four wheels with rubber tires and reinforced suspension systems adapted for heavier loads. Object which Feature has large sliding doors or double rear doors, enabling easy access for passengers or cargo loading. Object which Feature has wide windows along the sides or may have minimal windows depending on whether it is designed for cargo or passenger use. Object which Feature includes exterior components such as headlights, taillights, turn signals, mirrors, bumpers, windshield wipers, and sometimes roof racks. Object which Feature may appear in different configurations such as passenger vans, cargo vans, minivans, delivery vans, and commercial utility vans. Object which Feature has various color options including white, silver, black, gray, blue, or branded color schemes often used by companies. Object which Feature may show branding, company logos, text labels, or decals when used for transportation services, logistics, or delivery. Object which Feature has interior space designed for multiple rows of seats, open cargo areas, or modular storage structures depending on its use. Object which Feature may be observed moving, parked, turning, loading or unloading goods, or transporting groups of people. Object which Feature often appears in urban streets, commercial zones, loading areas, residential neighborhoods, highways, or near industrial facilities. Object which Feature may be partially occluded by pedestrians, cars, fences, buildings, or other environmental structures in complex scenes. Object which Feature exhibits visual cues such as tall silhouette, boxy body shape, large door panels, long side surfaces, and elevated roof that help differentiate it from cars or SUVs. Object which Feature may present different conditions such as new, weathered, clean, dirty, or carrying visible signs of long-term use. "
    ],
    [
        "truck",
        "A truck is a large motor vehicle designed for transporting goods, heavy loads, or specialized equipment, characterized by a robust structure and high carrying capacity. Object which Feature has a large chassis, reinforced frame, and elevated ground clearance to support heavy-duty transportation. Object which Feature typically has a cab section for the driver and a separate cargo area such as an open bed, enclosed box, container frame, or flatbed platform. Object which Feature has four or more wheels, often paired in dual-wheel configurations at the rear for stability under heavy loads. Object which Feature displays distinctive exterior components including large headlights, side mirrors, bumpers, exhaust pipes, fuel tanks, and often a tall front grille. Object which Feature may appear in various forms such as pickup trucks, cargo trucks, box trucks, delivery trucks, dump trucks, tanker trucks, or trailer-integrated vehicles. Object which Feature has diverse color appearances including white, blue, red, black, yellow, or company-branded paintwork and decals. Object which Feature often features logos, text, numbering, or reflective markings for commercial or industrial identification. Object which Feature may carry visible cargo such as boxes, construction materials, equipment, or sealed goods depending on its function. Object which Feature exhibits movement behaviors such as driving, turning, reversing, stopping for loading and unloading, or idling in traffic. Object which Feature often appears on highways, industrial zones, logistics centers, construction sites, city roads, or near warehouses and shipping docks. Object which Feature may be partially occluded by other vehicles, pedestrians, fences, trees, barriers, or architectural structures in busy environments. Object which Feature shows strong visual cues including its large size, tall height, long body, wide tires, and extended cargo section that differentiate it from smaller vehicles. Object which Feature may appear clean, weathered, dusty, rusted, or carrying dirt and stains depending on usage conditions. "
    ],
    [
        "tricycle",
        "A tricycle is a three-wheeled vehicle designed for transportation or recreational purposes. Object which Feature has two rear wheels and one front wheel forming a stable triangular base, with a seat for one or more riders and handlebars for steering. Object which Feature may be human-powered with pedals or motor-assisted depending on the design. Object which Feature appears in children’s tricycles, adult trikes, cargo tricycles, or commercial delivery tricycles. Object which Feature has various colors, structural frames, baskets, or storage boxes mounted on the rear or front. Object which Feature may be observed moving, stationary, parked on sidewalks, streets, or recreational areas, and may carry passengers or goods. Object which Feature displays visual cues including wheel arrangement, frame geometry, handlebars, pedals or engine, and seating position that differentiate it from bicycles or motorcycles. Object which Feature can include protective features such as reflectors, lights, safety bars, and can show wear, mud, scratches, or decorations depending on use. "
    ],
    [
        "awning-tricycle",
        "An awning-tricycle is a three-wheeled vehicle equipped with a canopy or cover, often used for transporting goods or passengers in shaded conditions. Object which Feature has a stable three-wheel base, a driver seat, and a covered cargo or passenger compartment. Object which Feature may be human-powered or motor-assisted, commonly seen in street markets, small-scale deliveries, or public transportation in dense urban areas. Object which Feature has visible structural features including canopy frame, wheels, pedals or engine, steering handles, and seating or cargo space. Object which Feature may be observed moving on streets, parked at loading zones, or maneuvering in crowded pedestrian areas. Object which Feature displays distinctive cues such as roof awning, three-wheel layout, cargo capacity, and human presence for identification. Object which Feature can have bright or faded colors, decorative patterns, commercial branding, tarpaulin cover, or protective shades, and may show wear from prolonged outdoor exposure. Object which Feature often interacts with pedestrians, street vendors, other vehicles, and urban infrastructure, providing shade for goods or passengers, and is commonly seen carrying items such as boxes, food, or equipment. "
    ],
    [
        "bus",
        "A bus is a large passenger vehicle designed to transport many people. Long and tall body, large windows, and multiple rows of seats, typically used for public transit. Object which Feature has a rigid frame with multiple doors for passenger entry and exit, often equipped with handrails, steps, and emergency exits. Object which Feature may appear in city buses, school buses, coaches, shuttle buses, or minibuses with different sizes and configurations. Object which Feature has diverse colors and branding including commercial advertisements, logos, route numbers, and safety markings. Object which Feature may be observed moving on streets, stopping at bus stops, or parked in depots or terminals. Object which Feature may be partially occluded by other vehicles, pedestrians, street furniture, or trees in urban environments. Object which Feature displays visual cues including its elongated body, multiple windows, door locations, wheelbase length, roof height, and mirror positions that distinguish it from vans or trucks. Object which Feature can have air-conditioning units or roof equipment, displays route signage, and shows wear such as dirt, scratches, or fading paint depending on age and usage. "
    ],
    [
        "motor",
        "A motorcycle is a two-wheeled motorized vehicle designed for individual transportation and agility. Object which Feature has a frame supporting two wheels, a fuel-powered engine, a seat for one or two riders, and handlebars for steering. Object which Feature may include components such as headlights, taillights, mirrors, exhaust pipes, footrests, and luggage racks. Object which Feature appears in different styles including scooters, sport bikes, cruisers, dirt bikes, touring motorcycles, or mopeds. Object which Feature has a wide range of colors including black, red, blue, silver, yellow, green, or combinations with decals and patterns. Object which Feature may be observed moving on streets, parked on sidewalks, in traffic, or performing dynamic maneuvers. Object which Feature shows visual cues such as wheel size, frame geometry, handlebar shape, engine visibility, exhaust design, and rider posture that help differentiate it from bicycles or cars. Object which Feature can have accessories such as luggage boxes, windshields, saddlebags, helmets, and decorative lights, and may appear clean, dusty, or worn depending on use. "
    ]
]